# Introduction to Data Science in Python
- <mark>Chaining</mark>, i.e. df[x][y] will generate a copy of what we want, which is dangerous
- Drop's optional paramters: Inplace - if set to true, then original data will be changed instead of a copy of the changes; Axis - default is 0
- Faster delete is: <code>del df\['Column name'\]</code>

In [2]:
import pandas as pd

In [3]:
purchase_1 = pd.Series({'Name': 'Winfred',
                        'Interest': 'PC Building',
                        'Cost': 1300.99})
purchase_2 = pd.Series({'Name': 'Kevyn',
                        'Interest': 'Kitty Litter',
                        'Cost': 220.40})
purchase_3 = pd.Series({'Name': 'Vinod',
                        'Interest': 'Bird Seed',
                        'Cost': 5.00})
df = pd.DataFrame([purchase_1, purchase_2, purchase_3], index = ['Person 1', 'Person 1', 'Person 3'])
df.head()

             Name      Interest     Cost
Person 1  Winfred   PC Building  1300.99
Person 1    Kevyn  Kitty Litter   220.40
Person 3    Vinod     Bird Seed     5.00

In [4]:
df.loc['Person 1']

             Name      Interest     Cost
Person 1  Winfred   PC Building  1300.99
Person 1    Kevyn  Kitty Litter   220.40

In [5]:
type(df.loc['Person 3'])

pandas.core.series.Series

In [7]:
df.T #transpose

             Person 1      Person 1   Person 3
Name          Winfred         Kevyn      Vinod
Interest  PC Building  Kitty Litter  Bird Seed
Cost          1300.99         220.4          5

In [11]:
df.T.loc['Name']

Person 1    Winfred
Person 1      Kevyn
Person 3      Vinod
Name: Name, dtype: object

In [6]:
df['Name']

Person 1    Winfred
Person 1      Kevyn
Person 3      Vinod
Name: Name, dtype: object

In [13]:
df.loc['Person 1']['Cost'] # chaining DANGEROUS!

Person 1    1300.99
Person 1     220.40
Name: Cost, dtype: float64

In [16]:
df

             Name      Interest     Cost
Person 1  Winfred   PC Building  1300.99
Person 1    Kevyn  Kitty Litter   220.40
Person 3    Vinod     Bird Seed     5.00

In [17]:
copy_df = df.copy()
copy_df = copy_df.drop('Person 1') # dropping data
copy_df

           Name   Interest  Cost
Person 3  Vinod  Bird Seed   5.0

In [27]:
df['College'] = 'CMU' # adds a new column in dataframe with this value 
df

             Name      Interest     Cost College
Person 1  Winfred   PC Building  1300.99     CMU
Person 1    Kevyn  Kitty Litter   220.40     CMU
Person 3    Vinod     Bird Seed     5.00     CMU

In [50]:
purchase_1 = pd.Series({'Name': 'Chris',
                        'Item Purchased': 'Dog Food',
                        'Cost': 22.50})
purchase_2 = pd.Series({'Name': 'Kevyn',
                        'Item Purchased': 'Kitty Litter',
                        'Cost': 2.50})
purchase_3 = pd.Series({'Name': 'Vinod',
                        'Item Purchased': 'Bird Seed',
                        'Cost': 5.00})

df2 = pd.DataFrame([purchase_1, purchase_2, purchase_3], index=['Store 1', 'Store 1', 'Store 2'])
df2

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 1  Kevyn   Kitty Litter   2.5
Store 2  Vinod      Bird Seed   5.0

In [52]:
df2['Cost'] *= 0.80
df2

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  18.0
Store 1  Kevyn   Kitty Litter   2.0
Store 2  Vinod      Bird Seed   4.0